<?php
$mas = array();//Массив данных
$n = 999;
$element = rand(1, $n);//Выбор случайного уникального числа 

//Заполняем массив
for($i=0; $i<=(2*$n)-2; $i+=2) {
	if($i%2 == 0) {
		$j = ($i+2)/2;
	} else {
		$j = ($i+3)/2;
	}
	
	if($j != $element) {
		$mas[$i] = $j;
		$mas[$i+1] = $j;
	} else {
		$mas[$i] = $element;
		$i--;
	}			
}

echo 'Данный массив:<br>';
//Вывод массива
for($i=0; $i <= (2*$n)-2; $i++) {
	echo "Mas[$i] = " . $mas[$i] . '; <br>';
}

echo '<hr>';
echo 'Ответ:<br>';

//Поиск уникального числа
for($i=0; $i<=(2*$n)-2; $i++){
	if($mas[$i] == $mas[$i+1]){
		$i++;
	} else {
		echo 'Уникальное число: ' . $mas[$i];
		$i = (2*$n)-2;
	}
}
?>